# PANDA WARRIORS
![Panda Warriors](../img/pw.jpg)

## ```Welcome to your challenge```

You and your teammates have been asigned the role of `panda warriors`, the frontline of the data wars. Brave and strong, you are always in combat to _data_ `clean` our enemies off of this world. With your magical weapon **regex**, your task is to prepare and explore the path ahead.

However, fighting the battle is not the end, you must live to tell the tale.

### The song of a hero

Your theme is: `pandas, regex and datacleaning`
The task in this challenge is twofold.
Your team must:
- Answer the most questions you can.
- List **at least** `5` topics of interest (important points) on the theme to guide your 20 min presentation to your fellow students.
- Work together and help each other out.

_TIP_: Remember to check your topics along the exercise and adjust them accordingly.

The team captain will be responsible for putting all the answers together on this notebook and making the pull request before the deadline set with the instructors.

# IMPORTANT POINTS

- 
- 
- 
- 
-

In [97]:
import pandas as pd
import re

In [98]:
# Loading dataset
# Run this cell
df = pd.read_csv("data/animals.csv", usecols=["id", "SciName", "PopName"])
#We use only the ID SciName and PopName colums
df.head()

               SciName              PopName    id
0      Panthera Pardus              Leopard  1446
1        Dugong Dugong               Dugong  1952
2   Tursiops Truncatus   Bottlenose dolphin  2001
3  Aplysia Californica  California sea hare  2246
4         Tinamiformes             Tinamous  3352

In [99]:
df.head()

               SciName              PopName    id
0      Panthera Pardus              Leopard  1446
1        Dugong Dugong               Dugong  1952
2   Tursiops Truncatus   Bottlenose dolphin  2001
3  Aplysia Californica  California sea hare  2246
4         Tinamiformes             Tinamous  3352

##### Your answer
```
<here>
```

The dataset you just loaded features part of the collection at a natural science museum. Should we check it for nulls? How?

If there are, show us the rows with nulls.

In [100]:
#There are cells with null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 189 entries, 0 to 188
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   SciName  188 non-null    object
 1   PopName  188 non-null    object
 2   id       188 non-null    object
dtypes: object(3)
memory usage: 4.6+ KB

In [101]:
df[df.isna().any(axis=1)]

    SciName PopName      id
103     NaN    name     NaN
154   binom     NaN  id_sp.

In [6]:
# We eliminate these rows with the following code

df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 187 entries, 0 to 188
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   SciName  187 non-null    object
 1   PopName  187 non-null    object
 2   id       187 non-null    object
dtypes: object(3)
memory usage: 5.8+ KB

Remove the unwanted rows. As we can see, there are scientific names composed of 1, 2 or 3 words. 

Using `regex`, can you select the following?
- Only those whose name is composed of 3 words
- Those whose first, second or third word begins with the letter c

In [7]:
 #r"[A-Za-z]*",

dividing = lambda x: re.split(" ",str(x))
#\d = digit \w=word     \w \w \w

#Obtain a list with different names
sci_list=df["SciName"].apply(dividing)
#Obtain a serie with the length of the list
sci_len=sci_list.apply(len)
#Select all with length = 3
df[sci_len == 3]

                        SciName                  PopName      id
21        Capra Aegagrus Hircus                     Goat   18446
73           Canis Lupus Arctos              Arctic wolf   57403
83   Equus Caballus Przewalskii  Przewalski's wild horse   68677
96   Panthera Pardus Orientalis             Amur leopard   78443
151      Equus Asinus Somalicus          Somali wild ass  115900
159     Panthera Tigris Altaica           Siberian tiger  123006

In [11]:
#Function to check when a word begin with C
def find_c(names):
    for name in names[:3]:
        if name[0].lower() == "c":
            return True
    
    return False
        
#Obtain a series with true/false that meets this condition
has_c=sci_list.apply(find_c)
#Selecting them and printing only the head
df[has_c].head()

                    SciName                PopName     id
3       Aplysia Californica    California sea hare   2246
6           Cavia Porcellus             Guinea pig   5207
21    Capra Aegagrus Hircus                   Goat  18446
25          Caracal Caracal                Caracal  21037
28  Conolophus Subcristatus  Galapagos land iguana  22009

How many names are there on each category(1 word, 2 words, 3 words)?

In [15]:
#Count different lengths
sci_len.value_counts()

2    117
1     64
3      6
Name: SciName, dtype: int64

Unfortunately, the scientific names are not properly writen. The first word, the Genus, should be capitalized. The second and third, species and sub-species, should be lowercase. Can you please fix it, please?

In [18]:
def clean_name(names):
    result=names[0]
    for name in names[1:]:
        result += " "+name.lower()
    return result

#2 métodos: 1 title, 2 capitalize

df["SciName"]=sci_list.apply(clean_name)
df.head()

               SciName              PopName    id
0      Panthera pardus              Leopard  1446
1        Dugong dugong               Dugong  1952
2   Tursiops truncatus   Bottlenose dolphin  2001
3  Aplysia californica  California sea hare  2246
4         Tinamiformes             Tinamous  3352

Let's see the second part of our data. Load the csv at `data/scientists.csv`.

In [76]:
df = pd.read_csv("data/scientists.csv")
df.head()

,name,1917,1918,1919,1920,1921,1922,1923,1924,1925,...,1941,1942,1943,1944,1945,1946,1947,1948,1949,1950
0,Demetria S. Donovan,26264.0,NaN,98916.0,NaN,NaN,NaN,NaN,NaN,NaN,...,125932.0,NaN,NaN,NaN,146661.0,NaN,NaN,NaN,41296.0,NaN
1,Fuller Alvarado,33373.0,NaN,57148.0,1446.0,19269.0,NaN,NaN,82925.0,NaN,...,NaN,NaN,NaN,144229.0,2001.0,NaN,79419.0,NaN,NaN,68677.0
2,Amelia Kelley,NaN,78443.0,120323.0,NaN,48297.0,NaN,NaN,NaN,NaN,...,NaN,NaN,88456.0,NaN,NaN,NaN,NaN,NaN,92275.0,NaN
3,Hector Y. Mendez,NaN,97660.0,57403.0,2246.0,39303.0,NaN,NaN,24520.0,NaN,...,NaN,NaN,118157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Theodore Keller,NaN,NaN,NaN,NaN,NaN,16284.0,NaN,NaN,136654.0,...,NaN,74624.0,NaN,NaN,121258.0,129663.0,46561.0,NaN,NaN,NaN

What can you say about this dataframe? What should we do to fix it?

It should probably be a little bit more like this:

![Table](../img/table.png)

In [96]:
columns=list(df.columns)
#df2= df.pivot(df,index=columns,columns='name')
df2=df.melt("name")
print(df2.shape)
df2.head(10)

(510, 3)

                  name variable    value
0  Demetria S. Donovan     1917  26264.0
1      Fuller Alvarado     1917  33373.0
2        Amelia Kelley     1917      NaN
3     Hector Y. Mendez     1917      NaN
4      Theodore Keller     1917      NaN
5     Hiram C. Nielsen     1917      NaN
6          Tatum Carey     1917  48564.0
7          Cara Morgan     1917      NaN
8         Libby Tucker     1917      NaN
9    Prescott S. Estes     1917  13423.0

Could you do it? How did you make it so the columns were now rows?

What is the shape of the dataframe after fixing it?

If you couldn't, I'll give you a hint. But you must try first! Panda Warrior honor code!

In [ ]:
###############################################################################################
# Uncomment and run for hint
# import base64
# base64.b64decode("WW91IG1pZ2h0IG5lZWQgZWl0aGVyIHRoZSBwaXZvdCBvciBtZWx0IGZ1bmN0aW9uLi4uLg==")

Can you join both dataframes now?

What kind of join is best suited? Left, Right, Inner, Outer? Why?

In [ ]:
# Your answer

Now that both dataframes are united, can you use `apply` one more time to create a new column that contains the binomial nomenclature, the scientist and the year of the study?

_Each element on the resulting column should be like:_ `Panthera pardus - Fuller Alvarado (1920)`

In [ ]:
# Your answer

How can we see the specimens studied by each scientist?

In [ ]:
# Your answer

How many specimens were studied by each scientist each year?

_Hint_: Use groupings

In [ ]:
# Your answer

### Discussion topics

The following are a few questions and points you should debate and think about with your teammates.

- When data cleaning, how should we evaluate our strategy regarding nulls? Deleting rows, deleting columns, filling nulls?
- May a column have elements of mixed data types?
- May a pandas.DataFrame have more than 2 dimensions?
- How does the axis parameter affect the apply?
- What is the difference between join and merge? What about concat?
- What is the difference between pivot and melt?

#### Extra
[Pandas Quiz!](https://www.wwf.org.uk/node/40546)